'''Создайте список из чисел, введенных с клавиатуры. Введите с клавиатуры число n. 
Возведите элемент под индексом n в степень n и выведите его'''
numbers=input().split()
m=int(input())
number=numbers[n]
number=int(number)
print(number**n)